<img src = 'ibrahimdavidlogo.gif'>

# b) **Data Wrangling:** Data Pre Processing

### **The Dataset: Campus Recruitment | Source:** <a href='https://www.kaggle.com/benroshan/factors-affecting-campus-placement'>Kaggle</a>

#### We will be undertaking the process of mapping the data from it's **_raw form_** into one that is ready for further analysis.

#### 1. Importing the required libraries/modules: **_Numpy_ & _Pandas_**, and Reading the _.CSV_ File.

In [1]:
# Pandas for Data Structure:
import pandas as pd

Let's download and import the Canadian Immigration dataset and covert to dataframe.

In [2]:
# Read a .csv File using Pandas:
df = pd.read_csv('campus_recruitment.csv')

# Displaying the First 5 Rows:
df.head()

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0

Additionally, if you wish to display the last 5 rows of the dataset, the `tail()` function is used:

In [3]:
df.tail()

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
210,211,M,80.6,Others,82.0,Others,Commerce,77.6,Comm&Mgmt,No,91.0,Mkt&Fin,74.49,Placed,400000.0
211,212,M,58.0,Others,60.0,Others,Science,72.0,Sci&Tech,No,74.0,Mkt&Fin,53.62,Placed,275000.0
212,213,M,67.0,Others,67.0,Others,Commerce,73.0,Comm&Mgmt,Yes,59.0,Mkt&Fin,69.72,Placed,295000.0
213,214,F,74.0,Others,66.0,Others,Commerce,58.0,Comm&Mgmt,No,70.0,Mkt&HR,60.23,Placed,204000.0
214,215,M,62.0,Central,58.0,Others,Science,53.0,Comm&Mgmt,No,89.0,Mkt&HR,60.22,Not Placed,NaN

#### 2. The Analysis may begin by getting basic information about the dataframe using the `info()` method.

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sl_no           215 non-null    int64
 1   gender          215 non-null    object
 2   ssc_p           215 non-null    float64
 3   ssc_b           215 non-null    object
 4   hsc_p           215 non-null    float64
 5   hsc_b           215 non-null    object
 6   hsc_s           215 non-null    object
 7   degree_p        215 non-null    float64
 8   degree_t        215 non-null    object
 9   workex          215 non-null    object
 10  etest_p         215 non-null    float64
 11  specialisation  215 non-null    object
 12  mba_p           215 non-null    float64
 13  status          215 non-null    object
 14  salary          148 non-null    float64
dtypes: float64(6), int64(1), object(8)
memory usage: 25.3+ KB

To get the list of column headers, the `.columns` parameter of the dataframe will be used.

In [5]:
df.columns.values

array(['sl_no', 'gender', 'ssc_p', 'ssc_b', 'hsc_p', 'hsc_b', 'hsc_s',
       'degree_p', 'degree_t', 'workex', 'etest_p', 'specialisation',
       'mba_p', 'status', 'salary'], dtype=object)

To get the list of indicies, the `.index` parameter will be used:

In [6]:
df.index.values

array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
        26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
        39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
        52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
        65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
        78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
        91,  92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103,
       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116,
       117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
       130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
       143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
       156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168,
       169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181,
       182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194,
       195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207,
       208, 209, 210, 211, 212, 213, 214], dtype=int64)

In [7]:
print(type(df.columns))
print(type(df.index))

<class 'pandas.core.indexes.base.Index'>
<class 'pandas.core.indexes.range.RangeIndex'>

Up Next, we need to convert get the index and columns into lists. For this, the `tolist()` method will be used.

In [8]:
# Converting Indes and Columns into Lists:
df.columns.tolist()
df.index.tolist()

# To Confirm the convertion, display the datatype of the newly created lists:
print (type(df.columns.tolist()))
print (type(df.index.tolist()))

<class 'list'>
<class 'list'>

#### When the **_`.shape`_** method is used, the dimensions of our Dataframe will be displayed in this format: **_`(Rows, Columns)`_.**

In [9]:
df.shape

(215, 15)

#### 3. The Column Names of the DataFrame **`(df)`** should be made Legible using the **_`rename()`_** method, for ease of Comprehension:

In [10]:
df.rename(columns={'sl_no':'Serial Number', 'gender':'Gender', 'ssc_p':'Secondary Education Percentage-10th Grade', 
                   'ssc_b':'Board of Education', 'hsc_p':'Higher Secondary Education percentage-12th Grade', 'hsc_b':'Board of Education', 
                   'hsc_s':'Specialization in Higher Secondary Education', 'degree_p':'Degree Percentage', 'degree_t':'Degree Type', 'workex':'Work Experience', 
                   'etest_p':'Employability Test Percentage', 'specialisation':'Post Graduation(MBA)- Specialization','mba_p':'MBA percentage', 
                   'status':'Status of placement- Placed/Not Placed', 'salary':'Salary offered by Corporate' }, inplace=True)
df.columns

Index(['Serial Number', 'Gender', 'Secondary Education Percentage-10th Grade',
       'Board of Education',
       'Higher Secondary Education percentage-12th Grade',
       'Board of Education', 'Specialization in Higher Secondary Education',
       'Degree Percentage', 'Degree Type', 'Work Experience',
       'Employability Test Percentage', 'Post Graduation(MBA)- Specialization',
       'MBA percentage', 'Status of placement- Placed/Not Placed',
       'Salary offered by Corporate'],
      dtype='object')

In [11]:
df.head()

,Serial Number,Gender,Secondary Education Percentage-10th Grade,Board of Education,Higher Secondary Education percentage-12th Grade,Board of Education,Specialization in Higher Secondary Education,Degree Percentage,Degree Type,Work Experience,Employability Test Percentage,Post Graduation(MBA)- Specialization,MBA percentage,Status of placement- Placed/Not Placed,Salary offered by Corporate
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0

We should check the total number of Null objects in the **df**:

In [12]:
df.isnull().sum()

Serial Number                                        0
Gender                                               0
Secondary Education Percentage-10th Grade            0
Board of Education                                   0
Higher Secondary Education percentage-12th Grade     0
Board of Education                                   0
Specialization in Higher Secondary Education         0
Degree Percentage                                    0
Degree Type                                          0
Work Experience                                      0
Employability Test Percentage                        0
Post Graduation(MBA)- Specialization                 0
MBA percentage                                       0
Status of placement- Placed/Not Placed               0
Salary offered by Corporate                         67
dtype: int64

Using the `describe()` method, we can view a summary of each column in our **df**:

In [13]:
df.describe()

,Serial Number,Secondary Education Percentage-10th Grade,Higher Secondary Education percentage-12th Grade,Degree Percentage,Employability Test Percentage,MBA percentage,Salary offered by Corporate
count,215.000000,215.000000,215.000000,215.000000,215.000000,215.000000,148.000000
mean,108.000000,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
std,62.209324,10.827205,10.897509,7.358743,13.275956,5.833385,93457.452420
min,1.000000,40.890000,37.000000,50.000000,50.000000,51.210000,200000.000000
25%,54.500000,60.600000,60.900000,61.000000,60.000000,57.945000,240000.000000
50%,108.000000,67.000000,65.000000,66.000000,71.000000,62.000000,265000.000000
75%,161.500000,75.700000,73.000000,72.000000,83.500000,66.255000,300000.000000
max,215.000000,89.400000,97.700000,91.000000,98.000000,77.890000,940000.000000

#### Save the new DataFrame into a new **`_.CSV_`** file.

In [14]:
df.to_csv('df1.csv')